app/views/chatrooms/show.html.erb

<div id="messages">
  <% @chatroom.messages.each do |message| %>
---
SELECT "messages".* FROM "messages" WHERE "messages"."chatroom_id" = $1  [["chatroom_id", 1]]